doc/lectures/annexe_compilation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Compilation et directives de préprocesseur</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="lecture_pointeur.html">Pointeurs, références & allocation dynamique </a><a href="lecture_fonction.html">Rappels sur les fonctions </a><a href="lecture_specificite_c++.html">Les spécificités du C++ </a><a href="lecture_struct_class.html">Structures et classes </a><a href="lecture_encapsulation.html">Encapsulation des données </a><a href="lecture_constructeur.html">Notions de constructeur et de destructeur </a><a href="lecture_amitie.html">Fonctions et classes amies </a><a href="lecture_surcharge.html">Surcharge d'opérateur </a><a href="lecture_heritage.html">Héritage </a><a href="lecture_template.html">Notions de patrons de fonctions et de classes </a><a href="lecture_librairie_standard.html">Introduction à la librairie standard STL </a><a href=""></a><hr/><a href="annexe_compilation.html">Compilation et directives de préprocesseur </a><a href="annexe_convention_ecriture.html">Convention d'écriture et organisation des programmes </a><a href="annexe_cout_cin.html">Écriture/lecture sur l'entrée/sortie standard </a><a href="annexe_variable_statique.html">Les membres données statiques </a><a href="annexe_enum_typedef.html">Utilisation de enum et de typedef </a>
                    <hr/>
                    <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Compilation et directives de préprocesseur</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Description détaillée du processus de compilation</h2>
<div class="outline-text-2" id="text-1">
<p>
Le processus de compilation se décompose en différentes phases conduisant à la
construction d&rsquo;un fichier binaire exécutable. Ces phases ne sont, en général,
pas spécifiques au C++ et quand bien même les différents outils de
programmation peuvent les cacher, le processus de génération des exécutables se
déroule toujours selon les principes suivant.
</p>

<p>
La première étape appelée <b>précompilation</b>, consiste à &ldquo;traiter&rdquo; <b>les fichiers
sources</b> (fichiers d&rsquo;en-tête: <code>*.h</code> ou <code>*.hh</code> et fichiers contenant le code à
proprement dit: <code>*.cc *.cpp</code>) avant compilation. Dans le cas du C et du C++, il
s&rsquo;agit des opérations effectuées par le préprocesseur (remplacement de macros,
suppression de texte, inclusion de fichiers&#x2026;). Le résultat de la
précompilation peut s&rsquo;obtenir <i>via</i> la commande suivante
</p>

<div class="prompt">
<p>
g++ -E fichier_source.cc
</p>

</div>

<p>
À la précompilation succède <b>la compilation séparée</b> qui est le fait de compiler
séparément les fichiers sources. Le résultat de la compilation d&rsquo;un fichier
source est généralement un fichier en assembleur, soit le langage décrivant les
instructions du microprocesseur de la machine cible pour laquelle le programme
est destiné. Cette étape conduit à la création de <b>fichiers objets</b> (d&rsquo;extension
<code>.o</code>) contenant la traduction du code assembleur en langage machine. Les données
initialisées, par exemple, sont également comprises dans les fichiers
objets. Pour ce qui concerne le C++, la commande nécessaire à la compilation
séparée s&rsquo;écrit :
</p>

<div class="prompt">
<p>
g++ -c fichier_source.cc
</p>

</div>

<p>
Cette opération créera, par conséquent, un fichier objet nommé
<code>fichier_source.o</code>. L&rsquo;ensemble des fichiers objets relatifs à un projet ou code
donné peuvent être regroupés en une librairie (statique ou dynamique) afin de
rassembler dans un même fichier les fonctionnalités développées.
</p>

<p>
L&rsquo;étape finale du processus de compilation consiste à regrouper la totalité des
données de même que les fichiers objets et les bibliothèques (fonctions de la
bibliothèque standard et des autres bibliothèques externes) ainsi qu&rsquo;à résoudre
les références inter-fichiers. Cette étape est appelée <b>édition de liens</b>
(<i>linking</i> en anglais). Le résultat de l&rsquo;édition de liens est <b>un fichier image</b>
qui pourra être chargé en mémoire par le système d&rsquo;exploitation. Les fichiers
exécutables et les bibliothèques dynamiques sont des exemples de fichiers
images. La commande relative à ce mécanisme est la suivante:
</p>

<div class="prompt">
<p>
g++ fichier_source1.o fichier_source2.o &#x2026; -o fichier_executable
</p>

</div>

<p>
Comme nous le soulignions en introduction, certains compilateurs peuvent
réaliser l&rsquo;ensemble de ces étapes en une seule opération. Le compilateur C++
peut ainsi compiler séparément l&rsquo;ensemble des fichiers sources et réaliser
l&rsquo;édition de liens <i>via</i> la commande
</p>

<div class="prompt">
<p>
g++ fichier_source1.cc fichier_source2.cc &#x2026; -o fichier_executable
</p>

</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Options de compilation</h2>
<div class="outline-text-2" id="text-2">
<p>
Le compilateur C++ autorise l&rsquo;utilisation d&rsquo;une multitude d&rsquo;options concernant
aussi bien l&rsquo;optimisation du processus de compilation que la compréhension et la
résolution des éventuels conflits. L&rsquo;ensemble des options disponibles pour la
commande <code>g++</code> peut être obtenu à l&rsquo;aide de l&rsquo;instruction =man g++=<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. Parmi
les multiples options disponibles<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>, la liste ci-dessous recense les plus
couramment utilisées:
</p>

<ul class="org-ul">
<li>l&rsquo;option <code>-Ichemin</code> indique au compilateur où sont localisés les fichiers
d&rsquo;entêtes nécessaires à la compilation séparée du programme. Par défaut, le
compilateur recherche ces fichiers localement et dans le répertoire
<code>/usr/include</code>,
</li>

<li>l&rsquo;option <code>-Lchemin</code> est essentiel lors du processus d&rsquo;édition de liens afin
d&rsquo;indiquer au compilateur où se situent les librairies externes. Soit le
chemin d&rsquo;accès est complet et pointe donc vers la librairie concernée, soit le
chemin d&rsquo;accès indique uniquement le répertoire où sont localisées les
librairies, auquel cas il est nécessaire de préciser le nom de la librairie à
utiliser <i>via</i> l&rsquo;option <code>-lnom_librairie</code>,
</li>

<li>l&rsquo;option <code>-W</code> permet l&rsquo;activation des messages de mise en garde (le <code>W</code> se
référant à l&rsquo;expression <i>warning</i>). Ces <i>warnings</i> n&rsquo;empècheront pas
l&rsquo;exécution du programme final mais fournissent des indications voir des
conseils en relation avec certaines parties du code. Différents niveaux de
mise en garde sont accessibles, le plus complet étant <code>-Wall -Wextra</code>,
</li>

<li>l&rsquo;option <code>-Didentificateur</code> permet la définition d&rsquo;identificateur à fournir
lors du processus de précompilation. L&rsquo;activation des directives de
préprocesseur peut se faire par ce biais ce qui permettra au compilateur
d&rsquo;insérer, de supprimer ou de modifier les portions de code relatives à cette
directive. À titre d&rsquo;exemple, il pourra s&rsquo;avérer utile lors d&rsquo;une phase de
débogage d&rsquo;un programme, de définir un identificateur <code>__DEBUG__</code> qui
affichera des informations complémentaires lors de l&rsquo;exécution du
programme. Afin d&rsquo;inclure ces instructions supplémentaires au sein du code, la
commande de compilation deviendra <code>g++ -D__DEBUG__ ...</code>,
</li>

<li>afin de profiter des processeurs multi-cœurs présents dans les machines
récentes, l&rsquo;option <code>-On</code> permet l&rsquo;optimisation de la compilation en
répartissant la charge de compilation sur <code>n</code> cœurs.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Directives de préprocesseur</h2>
<div class="outline-text-2" id="text-3">
<p>
Comme nous l&rsquo;avons rappelé en introduction à cette annexe, la compilation d&rsquo;un
programme se déroule en trois phases. La première est exécutée par le
préprocesseur et vise à remplacer les directives de compilation par des
instructions C++. Dans les faits, le préprocesseur recherche des directives de
compilation repérées en début de ligne par le symbole <code>#</code> et se terminant avec
la fin de la ligne. La syntaxe est ainsi
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#directive</span> [param&#232;tres]
</pre>
</div>

<p>
Il est possible de placer des espaces blancs avant et après la directive mais,
contrairement au compilateur, les sauts de lignes et les commentaires ne sont
pas considérés comme des blancs par le préprocesseur. Par conséquent, on ne doit
pas couper une ligne de directive, ni y placer un commentaire qui pourrait
entrer en conflit avec la directive. Notons qu&rsquo;il ne faut pas de point virgule
en fin de ligne.
</p>

<p>
Si la directive ne tient pas sur une seule ligne, il suffit d&rsquo;écrire le
caractère <code>\</code> juste avant le saut de ligne; dans ce cas, la ligne courante est
considérée comme la suite de la précédente. Rappelons que ceci est également
vrai pour le compilateur qui ignore les paires <code>\</code> + saut de ligne.
</p>

<p>
Parmi les différents types de directives de préprocesseur, la plus fréquemment
utilisée demeure la directive d&rsquo;inclusion <code>#include</code>. Elle indique au
préprocesseur de remplacer la ligne courante par l&rsquo;ensemble des lignes du
fichier donné en paramètre. En pratique, cette directive est essentiellement
utilisée pour inclure les fichiers d&rsquo;entête de librairies (fichiers
<code>*.h</code> ou <code>*.hh</code>).
</p>

<p>
La directive <code>#define identificateur</code> permet de définir un paramètre
&ldquo;identificateur&rdquo; qui pourra être utilisé dans une clause conditionnelle (<code>#if</code>,
<code>#ifdef</code>, <code>#ifndef</code> voir ci-après). L&rsquo;identificateur ne doit pas commencer par
un chiffre.
</p>

<p>
Par ailleurs, il est possible de contrôler ce qui sera compilé effectivement ou
non, avec les clauses de condition. Si l&rsquo;on écrit
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span> condition
...
<span class="org-preprocessor">#endif</span>
</pre>
</div>
<p>
la condition, qui doit être une constante numérique au format C++, est évaluée
par le préprocesseur; si la condition est non nulle, la clause <code>#if</code> est ignorée
et le code compris dans la séquence <code>#if</code> &#x2013; <code>#endif</code> est considéré par le
compilateur. En revanche, si la condition est nulle, tout ce qui se trouve entre
les directives <code>#if</code> et <code>#endif</code> est ignoré et donc non compilé. La clause <code>#if</code>
peut avoir une clause <code>#else</code> voir <code>#elif</code> (pour <code>else if</code>). Dans le cas
d&rsquo;identificateur tel que défini <i>via</i> la directive <code>#define</code>, on utilisera
l&rsquo;écriture suivante
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#ifdef</span> identificateur
...
<span class="org-preprocessor">#endif</span>
</pre>
</div>
<p>
ou sa négation
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span><span class="org-preprocessor"><span class="org-negation-char">n</span></span><span class="org-preprocessor">def</span> identificateur
...
<span class="org-preprocessor">#endif</span>
</pre>
</div>
<p>
Enfin, les clauses de compilation conditionnelles peuvent être imbriquées.
</p>

<p>
La directive <code>#define</code> sert également à la définition des macros. Il s&rsquo;agit
d&rsquo;abréviations ou de noms symboliques, traditionnellement en majuscules, se
référant à d&rsquo;autres objets tels qu&rsquo;une constante numérique ou une chaîne de
caractères. Les macros suivantes constituent des exemples classiques utilisés
notamment en&nbsp;C:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#define</span> <span class="org-variable-name">PI</span> 3.141592
<span class="org-preprocessor">#define</span> <span class="org-variable-name">ERRMSG</span> <span class="org-string">"Une erreur s'est produite.\n"</span>
<span class="org-preprocessor">#define</span> <span class="org-function-name">CARRE</span>(<span class="org-variable-name">x</span>) ((x) * (x))
</pre>
</div>

<p>
Le préprocesseur examine chaque ligne de code à la recherche du nom des macros
préalablement définies; si l&rsquo;un des noms est rencontré, son expression est
remplacée par sa valeur. Si la macro a plusieurs paramètres telle que <code>CARRE</code>
dans l&rsquo;exemple ci-dessus, chacun des paramètres est remplacé littéralement par
sa valeur effective. Ainsi, l&rsquo;écriture suivante
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">if</span> (CARRE(d) &gt; PI)
  printf(ERRMSG);
</pre>
</div>
<p>
deviendra après précompilation
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">if</span> (((d) * (d)) &gt; 3.141592)
  printf(<span class="org-string">"Une erreur s'est produite.\n"</span>);
</pre>
</div>
<p>
Les occurences de <code>x</code> ont été remplacées littéralement par <code>d</code>.
</p>

<p>
Une macro a donc une syntaxe similaire à celle d&rsquo;une fonction bien que leurs
traitements par le compilateur obéissent à des mécanismes sensiblement
différents : les macros résultent de la précompilation alors que les fonctions
sont compilées et donc soumises aux règles du C++. En ce sens, les macros sont
la source de nombreuses erreurs d&rsquo;autant plus difficiles à repérer qu&rsquo;on ne
dispose pas de la version étendue du code. À titre d&rsquo;exemple, l&rsquo;utilisation de
la macro <code>CARRE</code> suivant les instructions
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-variable-name">i</span> = 3;
<span class="org-type">int</span> <span class="org-variable-name">j</span> = CARRE(i++);
</pre>
</div>
<p>
provoquera la double incrémentation de la variable <code>i</code> en raison du remplacement
de l&rsquo;instruction <code>CARRE(i++)</code> par l&rsquo;expression <code>((i++) * (i++))</code> (et non une
simple incrémentation comme visiblement suggéré par le code). Aussi, les macros
sont généralement bannies du C++ et remplacées au profit de déclarations ne
faisant pas intervenir le précompilateur.
</p>

<p>
Ainsi, en C++, les macros qui définissent des constantes seront avantageusement
remplacées par des déclarations de la forme
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">Pi</span> = 3.141592;
<span class="org-keyword">const</span> <span class="org-type">string</span> <span class="org-variable-name">ErrMsg</span> = <span class="org-string">"Une erreur s'est produite.\n"</span>;
</pre>
</div>

<p>
De même, les macros telles que <code>CARRE</code> c&rsquo;est-à-dire définissant de simples
actions deviendront des fonctions en ligne (<i>cf.</i> <a href="lecture_spectificite_c++.html">Spécificités du C++</a>)
s&rsquo;écrivant
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">inline</span> <span class="org-type">long</span> <span class="org-function-name">Carre</span>(<span class="org-keyword">const</span> <span class="org-type">long</span> <span class="org-variable-name">l</span>) { <span class="org-keyword">return</span> l*l; }
<span class="org-keyword">inline</span> <span class="org-type">double</span> <span class="org-function-name">Carre</span>(<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">d</span>) { <span class="org-keyword">return</span> d*d; }
</pre>
</div>
<p>
qui vérifient, en outre, les types de leurs paramètres.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes"> </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<code>man</code>, pour <i>manual</i>, constitue l&rsquo;instruction
unix permettant de connaître les différents modes de fonctionnement
d&rsquo;une commande donnée
</p></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
pour plus d&rsquo;informations, le site internet
<a href="http://www.antoarts.com/the-most-useful-gcc-options-and-extensions/">http://www.antoarts.com/the-most-useful-gcc-options-and-extensions/</a> propose une
liste des options de <code>g++</code> les plus utiles.
</p></div>


</div>
</div></div>
</body>
</html>
